# commands/help.py


async def help_command(message):

    text = """
📚 راهنمای Empire Bot

━━━━━━━━━━━━━━

👤 پروفایل

نمایش اطلاعات:

پروفایل

شامل:
⭐ Level
✨ XP
💰 Coin
💎 Gem
👷 شغل
🎒 کیف
🚀 بوسترها


━━━━━━━━━━━━━━

👷 شغل‌ها

دیدن شغل‌ها:

شغل


انتخاب شغل:

انتخاب کشاورز


هر شغل:

💰 درآمد
✨ XP
⏳ زمان انتظار
🍞 مصرف غذا


━━━━━━━━━━━━━━

💼 کار

دستور:

کار


با کار کردن:

💰 Coin می‌گیرید
✨ XP می‌گیرید
🎲 احتمال Gem دارید


⏳ هر شغل زمان انتظار دارد.


━━━━━━━━━━━━━━

🍞 غذا

بعد از چند کار، ۱ غذا مصرف می‌شود.

بدون غذا:

❌ کار کردن ممکن نیست.


غذا از فروشگاه خریداری می‌شود.


━━━━━━━━━━━━━━

💎 Gem و بوسترها


⏳ Time Booster

زمان انتظار کار را نصف می‌کند.


💰 Double Rewards

Coin و XP را دو برابر می‌کند.


مدت بوسترها:

12 ساعت


━━━━━━━━━━━━━━

🛒 فروشگاه

دیدن:

فروشگاه


خرید:

خرید نام آیتم


مثال:

خرید غذا


━━━━━━━━━━━━━━

🎒 کیف

نمایش آیتم‌ها:

کیف


━━━━━━━━━━━━━━

🏦 بانک

دستورات:

بانک

ساخت کارت

ساخت کارت

واریز 1000

برداشت 500

کارت به کارت


━━━━━━━━━━━━━━

🏆 رتبه‌بندی

لیدربورد


نمایش:

⭐ Level
✨ XP
💎 Gem


━━━━━━━━━━━━━━

📜 قوانین

• تقلب و استفاده از باگ ممنوع.
• سوءاستفاده اقتصادی باعث مسدودی می‌شود.
• اسپم و مزاحمت ممنوع.
• قوانین ممکن است تغییر کنند.


━━━━━━━━━━━━━━

🚀 Empire Bot

Version 3
v3 powered by @commander04
"""


    try:

        await message.author.send(text)

        await message.reply(
            "📩 راهنما به پیوی شما ارسال شد."
        )

    except:

        await message.reply(
            "❌ ارسال پیوی امکان‌پذیر نیست."
        )
