# commands/help.py

async def help_command(message):

    text = """
📚 راهنمای Empire Bot

━━━━━━━━━━━━━━

👤 شروع بازی

پروفایل
نمایش اطلاعات، لول، پول و بوسترها


👷 کار و شغل

شغل
دیدن شغل‌ها

انتخاب کشاورز
انتخاب شغل

کار
دریافت Coin و XP


🎯 پیشرفت

ماموریت
چالش روزانه و جایزه

لیدربورد
رتبه‌بندی بازیکنان


🛒 آیتم‌ها

فروشگاه
دیدن آیتم‌ها

خرید نام آیتم
مثال:
خرید غذا

کیف
دیدن آیتم‌ها


🏦 بانک

بانک
ساخت کارت
واریز مقدار
برداشت مقدار

مثال:
واریز 1000


━━━━━━━━━━━━━━

💎 Gem:
ارز ویژه Empire برای خرید بوسترها

🚀 با کار کردن قوی‌تر شو،
Level بالا ببر و ثروتمندترین بازیکن شو!

━━━━━━━━━━━━━━

👑 Empire Bot
Version 3.2.5
Powered by @commander04
"""


    try:

        await message.author.send(text)

        await message.reply(
            "📩 راهنما به پیوی شما ارسال شد."
        )

    except:

        await message.reply(
            "❌ ارسال راهنما به پیوی امکان‌پذیر نیست."
        )
