from bale import Message


BOT_VERSION = "v1.0"



async def help_handler(bot, message: Message):

    text = f"""
🤖 Empire Bot

📌 نسخه ربات:
{BOT_VERSION}


🔥 درباره ربات:

Empire Bot یک ربات اقتصادی و سرگرمی برای گروه‌ها است.

کاربران می‌توانند:
💰 کوین کسب کنند
💼 شغل انتخاب کنند
🛒 آیتم خریداری کنند
⭐ سطح خود را افزایش دهند
🎒 وسایل خود را مدیریت کنند


━━━━━━━━━━━━━━

📚 دستورات اصلی:


👤 پروفایل:

پروفایل
پروفایل من
لول
سطح


💼 شغل‌ها:

شغل‌ها
شغل ها

برای انتخاب شغل:

انتخاب شغل [نام شغل]

مثال:
انتخاب شغل کشاورز


💰 کار کردن:

کار
کار کردن
کارکردن

با کار کردن:
💰 کوین دریافت می‌کنید
✨ XP می‌گیرید


🛒 فروشگاه:

فروشگاه
آیتم شاپ

خرید آیتم:

خرید [نام آیتم]

مثال:
خرید تبر


🎒 کیف:

کیف
کیف من
وسایل من


━━━━━━━━━━━━━━

🚀 امکانات آینده:

🏦 سیستم بانک
💳 کارت بانکی
📈 بازار ارز دیجیتال
🏢 شرکت‌ها
🏆 رتبه‌بندی کاربران
🎯 ماموریت‌ها


━━━━━━━━━━━━━━

👑 سازنده:

@commander04
"""

    await bot.send_message(
        message.chat.id,
        text
    )